{
    "birth_date": "1969",
    "source_records": [
        "amazon:0749938188"
    ],
    "photos": [
        7122227,
        7122226
    ],
    "name": "J. R. Ward",
    "key": "/authors/OL1120447A",
    "bio": {
        "type": "/type/text",
        "value": "Jessica Rowley Pell Bird was born on 1969 in Massachusetts, USA. She is the daughter of Maxine F. and W. Gillette Bird, Jr. She began writing as a child, penning her thoughts in diaries as well as inventing short stories. She read her first Harlequin Presents novel in a rose garden when she was in her teens. She was hooked immediately. By the time she went to college, she had boxes and boxes of Harlequins and Silhouettes. Every year, her mother would ask why all those books had to live in the house and Jess would reply that if even one of them disappeared she would know. (She'd catalogued them.)\r\n\r\nJess finished her first romance manuscript the summer before her freshman year of college. She attended Smith College and graduated with a double major in history and art history. She then received a law degree from Albany Law School. Shortly after that, she began working in the healthcare industry in Boston. She spent many years as one of the premier medical center’s Chief of Staff. While working as a lawyer in Boston, she completed two novels more and started a number of partials. In 2001, Bird married John Neville Blakemore III. Both her mother and her new husband kept telling her to send something in to an agent, a publisher, the Tooth Fairy, anyone. She thought they were nuts, but eventually got her nerve up and bought a lot of stamps. Since getting published, she has written contemporary romances as Jessica Bird and paranormal romances as J. R. Ward. She has been a Rita Award finalist, received two Romantic Times Reviewer's Choice nominations and has been a HOLT medallion finalist.\r\n\r\nNew England born and bred, Jess is surprised to find herself living south of the Mason Dixon line. (But that's what happens when you marry a Southern gentleman.) She and her husband live with their golden retriever, who oversees her writing in a supervisory role."
    },
    "alternate_names": [
        "Jessica Rowley Pell Bird Blakemore",
        "Jessica Bird",
        "J. R. Ward",
        "J.R.. Ward",
        "J.R. Ward",
        "J R Ward",
        "J-R Ward",
        "WARD J. R",
        "J.r. Ward",
        "Ward J. R",
        "ward-j-r"
    ],
    "personal_name": "J. R. Ward",
    "remote_ids": {
        "viaf": "158791569",
        "wikidata": "Q468550",
        "isni": "0000000046255608"
    },
    "type": {
        "key": "/type/author"
    },
    "latest_revision": 10,
    "revision": 10,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2025-03-11T07:48:56.806372"
    }
}