{
    "name": "Julie Beard",
    "personal_name": "Julie Beard",
    "key": "/authors/OL1385431A",
    "type": {
        "key": "/type/author"
    },
    "bio": "Julie Beard is a former journalist who brings her reporting skills to her award-winning, bestselling novels. Imagine investigating weapons of the Middle Ages, or the importance of reputations in the Victorian era, as she did when writing Midnight Angel (Berkley Sensation, December 2003). Julie has been hailed for her ability to magically recreate the distant past. Now she's busy \"world building\" in the future.\r\n\r\nJulie was one of the launch authors for the Silhouette Bombshell series, a new line of romantic action/adventure novels. She debuted with Kiss of the Blue Dragon (August 2004) featuring 28-year-old Angel Baker, a certified retribution specialist who strives to see justice done in the year 2104. \r\n\r\nJulie was a reporter and a news writer before turning her writing skills to more creative venues. She worked as the night beat for KSDK-TV, covering everything from murders to visiting politicians to hometown parades. As a news writer at the Fox affiliate in Chicago, she wrote copy for the legendary news anchor Walter Jacobson and Robin Robinson.\r\n\r\nJulie also has given dozens of workshops and lectures around the country at community colleges, bookstores and writers conferences. She's conducted seminars and written articles about editing, writing, promotions and journalism. She wrote the popular \"how-to\" book, The Complete Idiot's Guide to Getting Your Romance Published. This comprehensive nonfiction title offers advice on everything from plotting and editing a novel to finding an agent and publisher.\r\n\r\nJulie graduated from Northwestern University's prestigious Medill School of Journalism with a master of science degree in journalism. She graduated with a B.F.A. in theatre arts from Stephens College. She lives with her husband, two children and two incorrigible basenjis in the Midwest.",
    "remote_ids": {
        "viaf": "51282282",
        "isni": "0000000041387791",
        "wikidata": "Q123467755",
        "goodreads": "43501"
    },
    "photos": [
        14545428
    ],
    "latest_revision": 5,
    "revision": 5,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2023-11-17T05:19:08.108668"
    }
}