{
    "key": "/authors/OL1386317A",
    "birth_date": "1977",
    "name": "Nalini Singh",
    "personal_name": "Nalini Singh",
    "type": {
        "key": "/type/author"
    },
    "photos": [
        7105412
    ],
    "source_records": [
        "promise:bwb_daily_pallets_2023-01-31:P8-CIB-847"
    ],
    "bio": {
        "type": "/type/text",
        "value": "Nalini Singh is the New York Times and USA Today Bestselling author of the Psy-Changeling, Guild Hunter, and Rock Kiss series. She lives in New Zealand but travels as much as possible (the travel bug bit hard from when she escaped working as a lawyer to run away and teach English in Japan). Nalini loves to write, loves to read, and thinks chocolate is a food group. \r\n\r\nOf Indian descent, Nalini Singh was born in 1977 in Fiji, and moved to New Zealand as a child.\r\n\r\nIn 1999, Singh placed third in the Romance Writers of New Zealand's \"Clendon Award\". Then in 2001 her manuscript \"Coaxing the Sheik\" won the Jane Porter Award for highest-placed Mills and Boon, as well as the Clendon Award's Readers' Choice Award that year. It went on to be her first book sale as \"Desert Warrior\", sold to Silhouette Desire in September 2002 (published in 2003).\r\n\r\nHer books have appeared on the New York Times best-sellers list, the USA Today best-sellers list, and the Publishers Weekly best-sellers list.\r\n\r\nShe has won several other awards including the Sir Julius Vogel Award for best novella/novelette (twice, in 2008 and 2009).\r\n\r\nFind out more about Nalini at www.nalinisingh.com.\r\n\r\n\r\nhttps://en.m.wikipedia.org/wiki/Nalini_Singh_(author)\r\nhttps://www.amazon.com/Nalini-Singh/e/B001IXPTMW"
    },
    "alternate_names": [
        "Singh,Nalini"
    ],
    "latest_revision": 6,
    "revision": 6,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2024-06-21T16:36:43.415544"
    }
}