{
    "links": [
        {
            "title": "Katie Mac Website",
            "url": "http://www.katiemacalister.com",
            "type": {
                "key": "/type/link"
            }
        }
    ],
    "personal_name": "Katie MacAlister",
    "alternate_names": [
        "Katie Macalister",
        "KATIE MACALISTER"
    ],
    "photos": [
        6785785
    ],
    "key": "/authors/OL1386038A",
    "name": "Katie MacAlister",
    "type": {
        "key": "/type/author"
    },
    "bio": {
        "type": "/type/text",
        "value": "For as long as she can remember, Katie MacAlister has loved reading. Growing up in a family where a weekly visit to the library was a given, Katie spent much of her time with her nose buried in a book. Despite her love for novels, she didn't think of writing them until she was contracted to write a non-fiction book about software. Since her editor refused to allow her to include either witty dialogue or love scenes in the software book, Katie swiftly resolved to switch to fiction, where she could indulge in world building, tormenting characters, and falling madly in love with all her heroes.\r\n\r\nTwo years after she started writing novels, Katie sold her first romance, Noble Intentions. More than thirty books followed during the years after Noble's publication. Her novels have been translated into numerous languages, been recorded as audiobooks, received several awards, and placed on the New York Times, USA Today, and Publishers Weekly bestseller lists. She also writes for the young adult audience as Katie Maxwell, and for the mystery world as Kate Marsh.\r\n\r\nKatie lives in the Pacific Northwest with her husband and dogs, and can often be found lurking around online"
    },
    "remote_ids": {
        "goodreads": "28550",
        "isni": "0000000119515598",
        "wikidata": "Q1736582",
        "viaf": "79569859"
    },
    "latest_revision": 6,
    "revision": 6,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2024-08-04T04:53:10.487896"
    }
}