{
    "bio": {
        "type": "/type/text",
        "value": "Beverly Marie Inman was born on 23 December 1946 in Tuscumbia, Alabama, USA. Daughter of Doris Marie and Walter D. Inman Jr. A born romantic, she fell in love with The Beauty and the Beast epic at an early age, when her grandfather bought her an illustrated copy of the famous fairy tale. Even before she learned to read and write, her vivid imagination created magical words and fabulous characters inside her mind. Movies fascinated her, and by the time she was seven she was rewriting the movies she saw on television and at the local theater to give them all happy endings. By the age of nine she'd penned her first novel. She wrote short stories, TV scripts, poetry, and novels throughout high school and into college. \r\n\r\nAfter her marriage to Billy Ray Beaver, the \"love of her life\", and the births of her two children, Beverly continued to be a voracious reader and a devoted moviegoer, but she put her writing aspirations on hold until her children were teenagers. At every age of their lives, from infancy to adulthood, the children had been a true joy to her. She devoted herself to her husband and children and considered herself one of the many selfless \"supermoms\" who put their family's needs first. She believed she had had it all, just not all at the same time.  \r\n\r\nIn her mid-30s, Beverly returned to her former passion — writing — as a hobby, but before 40, she decided that she wanted to make writing a full-time career. And when she rediscovered an old dream — of becoming a published writer — no one was more supportive of her aspirations than her family. Her children were her greatest cheerleaders and her husband was her biggest supporter. After writing over 40 books and receiving numerous awards and nominations, as well as having books on the USA Today list and consistently on the Waldenbooks bestseller list, her career was indeed a dream come true. Having a fantastic family and fabulous friends, as well as making a living doing the one thing she had loved doing since childhood, she considered herself truly blessed. Beverly died suddenly of heart failure on 21 April 2011."
    },
    "name": "Beverly Barton",
    "personal_name": "Beverly Barton",
    "death_date": "21 April 2011",
    "alternate_names": [
        "Beverly Marie Inman Beaver",
        "Beverly Beaver",
        "Beverly Barton"
    ],
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "photos": [
        7072438
    ],
    "last_modified": {
        "type": "/type/datetime",
        "value": "2020-09-27T04:12:16.076500"
    },
    "latest_revision": 10,
    "key": "/authors/OL1385860A",
    "birth_date": "23 December 1946",
    "revision": 10,
    "type": {
        "key": "/type/author"
    },
    "remote_ids": {
        "viaf": "52867784",
        "wikidata": "Q4899469",
        "isni": "0000000071479451"
    }
}