{
    "bio": "Maureen Child was born 28 September 1951 in California, USA. She and her husband enjoy traveling, usually taking road trips with her parents. When she’s at home, she is kept busy with her two grown children and a somewhat confused golden retriever named Abbey. She is busy writing her next book.\r\n\r\nUnder her own name, Maureen Child writes short contemporary novels—books she loves to write because of their fast pace and condensed story telling, she is also writing funny, contemporary paranormal romances. Over the years, she’s written under lots of different names and she prefers the term ‘pseudonym’ to ‘alias’. As Ann Carberry, she wrote western historical romances. As Kathleen Kane, she wrote not only Americana romances, but western paranormal romances as well. As Sarah Hart, she wrote one really spectacular western paranormal that is still one of her favorites. And once, Ann Carberry even wrote a Victorian historical which she absolutely loved doing. She writes paranormal romance novels under the pesudonym of Regan Hastings. Now, a USA Today best selling author of more than ninety romance novels and novellas, she is a five time nominee for the prestigious Rita award from Romance Writers of America. One of her novels, A Pocketful Of Paradise, was made into a CBS-TV movie called The Soul Collector, starring Melissa Gilbert, Bruce Greenwood and Ossie Davis.",
    "name": "Maureen Child",
    "personal_name": "Maureen Child",
    "alternate_names": [
        "Ann Carberry",
        "Kathleen Kane",
        "Sarah Hart",
        "Regan Hastings"
    ],
    "photos": [
        7259032
    ],
    "key": "/authors/OL1385834A",
    "birth_date": "28 September 1951",
    "type": {
        "key": "/type/author"
    },
    "remote_ids": {
        "wikidata": "Q6792662"
    },
    "latest_revision": 6,
    "revision": 6,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2025-03-11T10:24:56.388342"
    }
}