{
    "bio": "Lori L. was born on November 14. She did not attend college and married with Allen Foster, her High School sweetheart. The marriage settled in Ohio. She held various jobs as a saleslady, a grocery store clerk, and a Proctor and Gamble material handler before having the first of her three sons in 1981, after that she stayed at home to raise them.\r\n\r\nUnlike many writers, Lori Foster never considered a writing career until she was in her early 30s. In fact, she'd never even read romances until her sister once forced a load of them on her while she was down sick and unable to fight back. But it was a blessing she quickly took to, and before long, she was thoroughly hooked. It seemed a natural progression for the reader to want to write, so Lori penned a romance novel in longhand, strictly for her own entertainment. Once that was done, she borrowed a typewriter and started another. When she attended a local writers' conference and discovered that not many people had ever completed a book, Lori began to realize she might actually have a talent for something that she absolutely loved doing.\r\n\r\nIt was only after writing 10 complete manuscripts that Lori made her first sale to Harlequin in 1996. Her second book launched the Temptation Blaze subseries and since then she's continued writing at a prolific pace. Her books have appeared on the New York Times Extended, Waldenbooks, and USA Today bestseller lists. Lori also contributes to Writer's Digest Magazine and the Romance Writers Report. She regularly presents workshops to her local chapter and at various conferences, including RWA National.\r\n\r\nThough Lori loves writing, her first priority will always be her family. She, her husband, and their three sons, all humorous, handsome, and honorable fellows, are quickly following in their father's footsteps.",
    "name": "Lori Foster",
    "personal_name": "Lori Foster",
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "alternate_names": [
        "Lori L. Foster",
        "L. L. Foster"
    ],
    "photos": [
        6457676
    ],
    "last_modified": {
        "type": "/type/datetime",
        "value": "2016-03-15T07:08:22.139636"
    },
    "latest_revision": 8,
    "key": "/authors/OL1386012A",
    "birth_date": "1958",
    "type": {
        "key": "/type/author"
    },
    "revision": 8
}