{
    "source_records": [
        "bwb:9780425036624",
        "promise:bwb_daily_pallets_2021-07-26",
        "promise:bwb_daily_pallets_2022-04-20:KQ-875-137"
    ],
    "photos": [
        7166154,
        7166156,
        7166153,
        7163467,
        7166155
    ],
    "type": {
        "key": "/type/author"
    },
    "bio": {
        "type": "/type/text",
        "value": "Ursula Torday was born on 19 February 1912 (some sources say her birth in 1888 or 1914) in London, England, UK, daughter of mixed parents, her mother was Scottish and her father was Hungarian. She studied at Kensington High School in London, before went to the Oxford University, where she obtained a BA in English at Lady Margaret Hall College, and later a Social Science Certificate at London School of Economics.\r\n\r\nIn 1930s, she published her first three novels with her real name, Ursula Torday. During the World War II she worked as a probation officer for the Citizen's Advice Bureau, and during the next seven years afterwars, she also running a refugee scheme for Jewish children, inspiration for several of her future novels like, The Briar Patch (aka Young Lucifer) and The Children (aka Wednesday's Children) as Charity Blackstock. She worked as a typist at the National Central Library in London, inspiration for her future novel Dewey Death as Charity Blackstock. She also teaching English to adult students.\r\n\r\nShe returned to publishing in early 1950s, using the pseudonyms of Paula Allardyce, Charity Blackstock (in some cases reedited as Lee Blackstock in USA), to sign her gothic romance and mistery novels, later she also used the pseudonym of Charlotte Keppel. Her novel Miss Fenny (aka The Woman in the Woods) as Charity or Lee Blackstock was nominated for Edgar Award. In 1961, her novel Witches' Sabbath won the Romantic Novel of the Year Award by the Romantic Novelists' Association.\r\n\r\nUrsula Torday passed away in 1997."
    },
    "personal_name": "Charity Blackstock",
    "birth_date": "19 February 1912",
    "name": "Charity Blackstock",
    "key": "/authors/OL1740227A",
    "remote_ids": {
        "viaf": "289952773",
        "wikidata": "Q283531",
        "isni": "0000000108322491"
    },
    "death_date": "6 March 1997",
    "alternate_names": [
        "Ursula Torday",
        "Paula Allardyce",
        "Lee Blackstock",
        "Charlotte Keppel",
        "Charity BLACKSTOCK",
        "CHARITY. (hardcover in jacket) BLACKSTOCK"
    ],
    "latest_revision": 15,
    "revision": 15,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2024-07-24T03:21:55.693386"
    }
}