{
    "alternate_names": [
        "L. Adams Beck",
        "E. Barrington",
        "Louis Moresby",
        "Lily Adams Beck",
        "L Adams D 1931 Beck",
        "L. Adams (Lily Adams) Beck",
        "Adams L. Beck",
        "Lily Moresby Adams Beck",
        "Barrington, E., d. 1931.",
        "E. BARRINGTON"
    ],
    "bio": "Elizabeth Louisa \"Lily\" Moresby was born on late 1862 in Queenstown, Cork, Ireland, UK, the second child of Irish Jane Willis (Scott) and English John Moresby, a Royal Navy Captain who explored the coast of New Guinea and was the first European to discover the site of Port Moresby. She was grand-daughter of Eliza Louisa and Fairfax Moresby. She had a eldest brother Walter Halliday, and four youngest sisters Ethel Fortescue, Georgina, Hilda Fairfax and Gladys Moresby. Due to he father's work and her marriage to a Royal Navy commander Edward Western Hodgkinson, she lived and traveled widely in the East, in Egypt, India, China, Tibet, and Japan. Asian culture would greatly influence her and became a staunch Buddhist. She collabored in the writing of her father's book. Two Admirals: Sir John Moresby and John Moresby (1909).\r\n\r\nAfter widowing around 1910, she remarried in 1912 to retired solicitor Ralph Coker Adams Beck. In 1919, the marriage visit Victoria, British Columbia, Canada, where she settled alone eventually. Surrounded by her Oriental art and Oriental servants, she entertained fortnightly at her home on Mountjoy Avenue in Oak Bay as a strict vegetarian with ascetic inclinations.\r\n\r\nShe began her writing career publishing short-stories for Newspapers and Magazines. She was 60 years old by the time she started to publishing her first books. She used various pen names such as L. Adams Beck for books in oriental setting or about esoteric themes, E. Barrington for novelized biographies of British historical figures, and Louis Moresby for novles set in exotic locales.\r\n\r\nShe returned to Asia, and continued to write until her death on 3 January 1931 in Miyako Hotel, Kyoto, Japan.",
    "type": {
        "key": "/type/author"
    },
    "death_date": "3 January 1931",
    "name": "Elizabeth Louisa \"Lily\" Moresby",
    "photos": [
        8778796
    ],
    "personal_name": "L. Adams Beck",
    "birth_date": "1862",
    "key": "/authors/OL1917858A",
    "source_records": [
        "ia:storyoforientalp0000beck_g6j1",
        "bwb:9781113846938",
        "amazon:0353064424",
        "ia:mysteryofstella00beck",
        "ia:goldenvanity01beck",
        "ia:gloriousapollo00beck_0",
        "bwb:9781407796857",
        "ia:walpolebeauty00beck",
        "bwb:9781437894561",
        "bwb:9780554267029",
        "bwb:9781419268359"
    ],
    "latest_revision": 10,
    "revision": 10,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2022-09-22T01:29:12.921004"
    }
}