{
    "bio": {
        "type": "/type/text",
        "value": "Keyes was born in Meridian, Mississippi, as John Gregory Keyes, to a large, diverse, storytelling family. He received degrees in anthropology from Mississippi State University and the University of Georgia before becoming a full-time writer. Gregory Keyes (born April 11, 1963) is an American writer of science fiction and fantasy who has written both original and media-related novels under both the names J. Gregory Keyes and Greg Keyes.\r\n\r\nHe is famous for his tetralogy  The Age of Unreason, a steampunk/alchemical story featuring Benjamin Franklin and Isaac Newton. He wrote the Babylon 5 Psi Corps trilogy, a history of the Psi Corps and a biography of Psi Corps member Alfred Bester.\r\n\r\nIn 2003 he began a fantasy series titled The Kingdoms of Thorn and Bone, the first volume of which was The Briar King. The second book in the series The Charnel Prince was published in 2004 and the third, The Blood Knight, was published in July 2006. His fourth and final book of the quartet, The Born Queen, was released in March 2008.\r\n\r\nIn 2009 it was announced that Keyes would be writing two novels based on the successful computer game The Elder Scrolls IV: Oblivion. The first of these, The Infernal City, was published by Random House in November 2009.  The second, Lord of Souls, went on sale on September 27, 2011."
    },
    "key": "/authors/OL220530A",
    "type": {
        "key": "/type/author"
    },
    "photos": [
        11140740
    ],
    "links": [
        {
            "title": "author site",
            "url": "https://www.jgregorykeyes.com/",
            "type": {
                "key": "/type/link"
            }
        }
    ],
    "personal_name": "J. Gregory Keyes",
    "remote_ids": {
        "viaf": "85379121",
        "wikidata": "Q1544958",
        "isni": "0000000114504646"
    },
    "alternate_names": [
        "Greg Keyes",
        "Keyes Greg",
        "keyes-j-gregory",
        "Gregory J. Keyes",
        "Jacques Collin (Traduction) Greg Keyes "
    ],
    "birth_date": "1963",
    "name": "J. Gregory Keyes",
    "source_records": [
        "bwb:9780316485395",
        "ia:lechevalierdesan0000keye",
        "promise:bwb_daily_pallets_2022-11-01:P8-ABR-145",
        "amazon:1405033568"
    ],
    "latest_revision": 6,
    "revision": 6,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2023-05-23T19:22:17.399268"
    }
}