{
    "name": "Theodore Sturgeon",
    "bio": {
        "type": "/type/text",
        "value": "Theodore Sturgeon was born Edward Hamilton Waldo in Staten Island, New York.  He changed his name in 1929, choosing Sturgeon to match his mother's surname after her second marriage, and \"Theodore\" to match his nickname, \"Teddy.\"  His mother, Christine Hamilton Dicker Sturgeon, was a well-educated writer, watercolorist, and poet who published journalism, poetry and fiction under the pseudonym Felix Sturgeon.\r\n\r\nAs an adolescent, Sturgeon wanted to be a circus acrobat, but then had an episode of rheumatic fever.  From 1935 to 1938, he was a sailor in the merchant marine. He sold his first story in 1938, and his first science fiction story, \"Ether Breather\" was published in Astounding Science Fiction in 1939.  A few of his early pulp stories were published under the pseudonym \"E. Waldo Hunter.\"  \r\n\r\nHe married his first wife, Dorothe Fillingame, in 1940.  That year, they moved to the West Indies, where Sturgeon managed a hotel for about a year.  He served in the U.S. Army during World War II, and in 1944 he returned to the U.S. and worked as an advertising copywriter.  He divorced in 1945, and married singer Mary Mair in 1949 until an annulment in 1951.  In 1950, he published his first novel, The Dreaming Jewels.  In 1951, he married Marion McGahan and they had a son in 1952, a daughters in 1954, a daughter in 1956, and a son in 1960.  In 1963, he ghost-wrote the Ellery Queen mystery novel The Player on the Other Side, which received critical praise.  He wrote two screenplays for the television show Star Trek in 1966 and 1967, and one screenplay for the show Land of the Lost in 1975, and two of his stories were adapted for The New Twilight Zone.  At the height of his popularity in the 1950s he was the most anthologized author alive.\r\n\r\nHis last long-term committed relationship was with writer and educator Jayne Engelhart Tannehill, with whom he remained until the time of his death.  He died in May of 1985 of lung fibrosis, in Eugene, Oregon."
    },
    "death_date": "8 May 1985",
    "photos": [
        5542186
    ],
    "alternate_names": [
        "Théodore Sturgeon",
        "Edward Hamilton Waldo",
        "E. Waldo Hunter"
    ],
    "location": "Springfield, OR",
    "remote_ids": {
        "wikidata": "Q240253",
        "isni": "0000000120314654",
        "viaf": "100257330"
    },
    "birth_date": "26 February 1918",
    "personal_name": "Theodore Sturgeon",
    "fuller_name": "Thodore H. Sturgeon",
    "type": {
        "key": "/type/author"
    },
    "source_records": [
        "amazon:2266004557",
        "amazon:227723074X",
        "promise:bwb_daily_pallets_2022-08-16",
        "promise:bwb_daily_pallets_2021-04-26",
        "promise:bwb_daily_pallets_2023-05-24:KO-193-438",
        "amazon:2702406041",
        "promise:bwb_daily_pallets_2021-07-26",
        "promise:bwb_daily_pallets_2023-02-08:W8-BNM-650",
        "promise:bwb_daily_pallets_2020-07-07",
        "promise:bwb_daily_pallets_2022-05-23",
        "promise:bwb_daily_pallets_2023-05-15:KM-999-595",
        "amazon:0716553112"
    ],
    "links": [
        {
            "url": "http://www.physics.emory.edu/~weeks/misc/sturgeon.html",
            "title": "Website",
            "type": {
                "key": "/type/link"
            }
        }
    ],
    "key": "/authors/OL24562A",
    "latest_revision": 16,
    "revision": 16,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2025-01-13T16:07:47.944732"
    }
}