{
    "birth_date": "15 September 1934",
    "source_records": [
        "amazon:0606397841",
        "amazon:1442006358",
        "ia:laleyendadelaflo0000depa",
        "bwb:9780784820117",
        "bwb:9781484474716",
        "amazon:0590610899",
        "ia:wushiyulong0000depa",
        "amazon:0606016910",
        "amazon:0812441222",
        "amazon:0590212753",
        "amazon:0397308426"
    ],
    "alternate_names": [
        "Tomie DePaola",
        "Tomie de Paola",
        "Tomie De Paola",
        "Tomie Depaola",
        "Retold By Tomie DePaola"
    ],
    "death_date": "30 March 2020",
    "name": "Tomie dePaola",
    "type": {
        "key": "/type/author"
    },
    "remote_ids": {
        "isni": "0000000121309128",
        "wikidata": "Q4566686",
        "viaf": "46759613"
    },
    "personal_name": "De Paola, Tomie.",
    "bio": {
        "type": "/type/text",
        "value": "Thomas Anthony de Paola was born in Meriden, Connecticut.  He became interested in art at an early age.  After graduating from high school, he attended the Pratt Institute in Brooklyn, New York.  In 1956, he graduated with his Bachelor of Fine Arts degree.  He taught art at Newton College of the Sacred Heart from 1962 to 1966, then moved to California where he taught at San Francisco College for Women from 1967 to 1970. His first illustrated book, *Sound*, was published in 1965. In 1969, he received his Master of Fine Arts degree from California College of Arts and Crafts in Oakland.\r\n\r\nHe relocated to New England and taught art at Chamberlayne Junior College in Boston from 1972 to 1973. He then became an associate professor, designer, and technical director in the Speech and Theater department at Colby-Sawyer College from 1973 to 1976. In 1976, he received the Caldecott Honor for *Strega Nona* (1976). In 1978 he left teaching to become a full-time author and illustrator, while still living in New London, New Hampshire. Tomi passed away in March, 2020."
    },
    "photos": [
        12717161
    ],
    "key": "/authors/OL2627552A",
    "latest_revision": 22,
    "revision": 22,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-29T13:35:46.876380"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2025-01-13T16:32:13.136431"
    }
}