{
    "key": "/authors/OL26887A",
    "source_records": [
        "ia:deverschrikkelij0000simo",
        "amazon:1444001418"
    ],
    "remote_ids": {
        "viaf": "57311547",
        "isni": "0000000071398141",
        "wikidata": "Q2583271"
    },
    "personal_name": "Francesca Simon",
    "type": {
        "key": "/type/author"
    },
    "birth_date": "1955",
    "name": "Francesca Simon",
    "alternate_names": [
        "Francesca and McMullen Simon",
        "Simon Francesca",
        "simon-simon-francesca",
        "simon-francesca"
    ],
    "photos": [
        14380677
    ],
    "bio": {
        "type": "/type/text",
        "value": "Francesca Isabella Simon MBE (born 23 February 1955) is an American-born British author who resides in North London. She is most famous for writing the Horrid Henry series of children's books.\r\n\r\nSimon was born in St. Louis, Missouri, U.S. She grew up in California and studied at Yale and Jesus College, Oxford, where she majored in medieval studies and Old English. Simon worked as a journalist, writing for the Sunday Times, Guardian, Mail on Sunday, The Daily Telegraph and Vogue (US).\r\n\r\nSimon was inspired to write by Anthony Trollope. After she gave birth to her son, Joshua, in 1989, she began to write children's books full-time. Simon is one of the UK's best-selling children's writers; she has published over 50 different books, including her most popular series Horrid Henry series, which has sold over 25 million copies, and has been translated into 24 languages.\r\n\r\nSimon lives in London with her husband, Martin, and her son. Their Tibetan spaniel, Shanti, is memorialized in the short story \"Shanti\" that Simon wrote for inclusion in the Paws and Whiskers anthology by fellow author Jacqueline Wilson published in February 2014.\r\n\r\nIn the spring of 2019 the Royal Opera House staged an opera based on Simon's book The Monstrous Child, about the Norse god of the dead, Hel, as an angry teenager. The opera is composed by Gavin Higgins with libretto by Simon."
    },
    "latest_revision": 9,
    "revision": 9,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2023-07-18T11:00:23.706659"
    }
}