{
    "bio": "Joris-Karl Huysmans is the pen name of 19th century French novelist and art critic Charles-Marie-Georges Huysmans. His early works were in the Naturalist school, and he later wrote Symbolist and Catholic literature, paralleling his own conversion to Roman Catholicism. Huysmans is best remembered for his 1884 Décadent novel À rebours.\r\n \r\nJoris-Karl Huysmans was born on 5 February 1848 in Paris, the son of a Dutch lithographer and a former school teacher. When Joris-Karl was eight, his father died, and his mother soon after remarried. After earning the baccalauréat, Huysmans held a clerical position in the French Ministry of the Interior for 32 years. He was drafted for the Franco-Prussian War of 1870, but discharged due to dysentery.\r\n\r\nHuysmans' first published book was a Décadent prose poem collection entitled Le drageoir à épices (1874). It was followed two years later by his first novel, Marthe, histoire d'un fille (Marthe, the Story of a Girl). This novel and those that would follow over the next decade were written in the Naturalist school and praised by Emile Zola. Marthe was about a prostitute, and other themes Huysmans explored in his early works included failed marriage, dead-end jobs, and everyday life in Paris.\r\n\r\nÀ rebours, which details the increasingly bizarre entertainments of an effete, reclusive antihero, marked a turning point in Huysmans' career. Zola, among others, condemned the work, which represented a major departure in style for Huysmans. Critics were scandalized at the book's content. However, though the work lost its author some supporters, it gained him a new following among Symbolist and Décadent writers, including Oscar Wilde, Paul Valéry, and Stéphane Mallarmé. Wilde incorporated À rebours into his novel The Picture of Dorian Gray, though he did not mention it by name.\r\n\r\nA few more Décadent works were to follow À rebours, including En rade in 1887 and Là-Bas in 1891. The latter became notorious for its portrayal of Parisian Satanism and featured the debut of a recurring semi-autobiographical character in Huysmans' works, the writer Durtal. In Là-Bas, Durtal is working on a book about the medieval serial killer Giles de Rais when he finds himself torn between the influences of a pious cathedral bell-ringer and a woman involved in a Satanic cult who becomes his mistress.\r\n\r\nDurtal would reappear in Huysmans' next two books, En route (1895) and La cathédrale (1898), which deal with the protagonist's conversion to Catholicism. La cathédrale became his best-selling work in his lifetime and allowed him to retire from his work as a civil servant. Durtal appeared in one more of Huysmans' novels, L'Oblat, in which he becomes an oblate, or a layperson dedicated to prayer. Durtal's experiences throughout Huysmans' work reflect the author's real life.\r\n\r\nHuysmans became a Chevalier of the Légion d'honneur in 1892 for his work at the Ministry of the Interior, and was promoted to Officier in 1905 in honor of his contribution to French literature. Sadly, he was diagnosed with oral cancer the same year. Joris-Karl Huysmans passed away on 12 May 1907 and is buried in the Montparnasse cemetery in Paris.\r\n\r\n[Source][1]\r\n\r\n\r\n  [1]: http://www.wisegeek.com/who-is-joris-karl-huysmans.htm",
    "source_records": [
        "amazon:2845781008",
        "amazon:0342993550",
        "amazon:1034318381",
        "amazon:2011862760",
        "amazon:0244388369",
        "bwb:9781912868612",
        "amazon:2013059353",
        "amazon:1546603484",
        "bwb:9780274675883",
        "amazon:1645250334",
        "bwb:9781385968024",
        "bwb:9781385978863",
        "bwb:9780353862050",
        "bwb:9780353774209",
        "amazon:9750806972",
        "amazon:6054054295",
        "bwb:9798498200682",
        "bwb:9782406085355",
        "promise:bwb_daily_pallets_2022-12-16",
        "bwb:9781701307667",
        "bwb:9781177297172",
        "marc:marc_scms/20220805_ADAM_MARC_records.mrc:120279018:1413"
    ],
    "birth_date": "5 feb 1848",
    "death_date": "12 mai 1907",
    "name": "Joris-Karl Huysmans",
    "type": {
        "key": "/type/author"
    },
    "key": "/authors/OL2658897A",
    "remote_ids": {
        "isni": "0000000121296267",
        "wikidata": "Q210798",
        "viaf": "41841635"
    },
    "personal_name": "Huysmans, J.-K.",
    "alternate_names": [
        "Huysmans, J.-K.",
        "J.-K Huysmans",
        "J.K. Huysmans",
        "J. -K Huysmans",
        "J. K Huysmans",
        "J.-K. (Joris Karl) Huysmans",
        "Huysmans J.-K.",
        "J-.K. Huysmans",
        "K. J. Huysmans",
        "J K Huysmans",
        "J-K HUYSMANS",
        "J.-K. Joris-Karl Huysmans",
        "HUYSMANS, J.-K. (JORIS-KARL), 1848-1907.",
        "J. K. Huysmans",
        "Joris Karl Huysmans",
        "Joris­Karl Huysmans",
        "Huysmans",
        "J. Huysmans",
        "JORIS-KARL HUYSMANS",
        "Jarl-Karl Huysmans",
        "Joris -Karl Huysmans",
        "Joris-Karl HUYSMANS",
        "J.-K. Huysmans",
        "J-K 1848-1907 Huysmans",
        "Joris K. Huysmans",
        "HUYSMANS J K",
        "J.K. HUYSMANS",
        "HUYSMANS-J-K",
        "Joris-Karl, Huysmans,",
        "J-k 1848-1907 Huysmans",
        "Charles-Marie-Georges Huysmans",
        "Huysmans J. -K (Joris-Karl)",
        "J. -K (Joris-Karl) 1848-1907 Huysmans",
        "J.K Huysmans",
        "Huysman, Joris Karl, 1848-1907."
    ],
    "photos": [
        6868586
    ],
    "latest_revision": 12,
    "revision": 12,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-29T13:35:46.876380"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2023-05-22T21:27:56.678062"
    }
}