{
    "source_records": [
        "amazon:1743316488",
        "amazon:1742374026",
        "amazon:0702302198",
        "promise:bwb_daily_pallets_2022-09-20",
        "bwb:9781405258685"
    ],
    "remote_ids": {
        "viaf": "92541315",
        "wikidata": "Q552911",
        "isni": "0000000116864899"
    },
    "bio": {
        "type": "/type/text",
        "value": "Sean Llewellyn Williams (born in Whyalla, South Australia on 23 May 1967) is a New York Times best selling science fiction author who lives in Adelaide, South Australia. He is the author of over eighty published short stories and thirty-nine novels, including Twinmaker and (with Garth Nix) the Troubletwisters series. He has co-written three books in the Star Wars: New Jedi Order series and is a multiple recipient of both the Ditmar and Aurealis Awards. His novelisation of Star Wars: The Force Unleashed was the first novelisation of a computer game to debut at #1 on the \"New York Times\" bestseller list.\r\n\r\nHe studied sciences and music at Pulteney Grammar School and matriculated third in his year (1984), topping the state for Musical composition. That same year, he won the Young Composer's Award for a theme and three variations for string quartet with flute, oboe and trumpet soloists called \"Release of Anger\". He then went to Adelaide University and studied a Bachelor of Economics and wrote for the student newspaper On Dit. He completed a Master of Arts in Creative Writing at Adelaide University in 2005 and was in 2010 a PhD candidate at the same institution.\r\n\r\nSean Williams was Chair of the SA Writers' Centre from 2001-2003, and is one of only three lifetime members of that institution. His publishers include HarperCollins Australia, HarperTeen, Allen & Unwin, Egmont UK, Del Rey, Ace, Pyr, Swift and Ticonderoga Publications. Williams has also tutored for the Clarion South Workshop, was a previous winner of the Writers of the Future contest, and is now a Judge for the same."
    },
    "type": {
        "key": "/type/author"
    },
    "alternate_names": [
        "williams-sean",
        "Sean Williams & Shane Dix",
        "Sean Williams Christian Rummel",
        "Sean Williams and Shane Dix",
        "Sean, Williams, Garth, Nix"
    ],
    "birth_date": "23 May 1967",
    "personal_name": "Williams, Sean",
    "key": "/authors/OL2645009A",
    "name": "Sean Williams",
    "photos": [
        10888202
    ],
    "latest_revision": 14,
    "revision": 14,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-29T13:35:46.876380"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2024-04-24T07:08:09.374239"
    }
}