{
    "name": "Harry Harrison",
    "bio": "Harry Max Harrison was born Henry Maxwell Dempsey in Stamford, Connecticut. He moved with his family to New York early in his childhood. On his 18th birthday, having graduated from high school, he was drafted into the U.S. Army Air Corps, and serves as an armourer, gunnery instructor, truck driver, and military police officer. When the war ended, he became an art student at both the Hunter College in New York City and the Cartoonists and Illustrators School. Upon graduation, he became a freelance graphic artist, providing illustrations for book covers, magazines, and comic books such as Weird Fantasy and Weird Science. He also began contributing articles to these magazines. In 1952, he moved into editing pulp magazines such as Amazing Stories and Fantastic. In 1954 he married, and their first child was born in 1955. In 1956 he became a full-time writer, and began working on his first book in addition to writing for other publications such as The Saint syndicated comic strips. Over the next decade he and his family moved to several places, including Mexico, England, Italy, back to New York for the birth of their second child in 1959, to Denmark for seven years, back to England in 1965, San Diego in 1967, and finally Ireland in 1975 where they settled. Harrison produced over 60 books, occasionally in collaboration with other well-known writers such as Gordon R. Dickson.",
    "birth_date": "12 March 1925",
    "type": {
        "key": "/type/author"
    },
    "source_records": [
        "amazon:0722143443",
        "amazon:0722143559"
    ],
    "alternate_names": [
        "Hank Dempsey"
    ],
    "remote_ids": {
        "isni": "0000000368644868",
        "viaf": "80169724",
        "wikidata": "Q489193"
    },
    "title": "pseud. van Henry Maxwell Dempsey",
    "death_date": "15 August 2012",
    "personal_name": "Harry Harrison",
    "location": "Dublin, Ireland",
    "photos": [
        14595114,
        5539267
    ],
    "links": [
        {
            "title": "Website",
            "url": "http://www.harryharrison.com/",
            "type": {
                "key": "/type/link"
            }
        }
    ],
    "key": "/authors/OL27278A",
    "latest_revision": 16,
    "revision": 16,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2024-11-30T04:34:43.522201"
    }
}