{
    "type": {
        "key": "/type/author"
    },
    "birth_date": "13 August 1947",
    "source_records": [
        "amazon:1857984196",
        "amazon:0739080598"
    ],
    "bio": "Steve Perry was born and raised in the deep south and has lived in Louisiana, California, Washington and Oregon. He is married to the former Dianne Waller, an executive with the Port of Portland. They have two grown children, four grandsons, a German Shepherd Dog, and a cat.\r\n\r\nBefore turning to full-time freelance writing, Perry held a variety of jobs, including: swimming instructor and lifeguard; toy assembler; hotel gift shop and car rental clerk; aluminum salesman; martial arts instructor; private detective; Licensed Practical Nurse and Certified Physician's Assistant.\r\n\r\nPerry has sold dozens of stories to magazines and anthologies, as well as a considerable number of novels, animated teleplays, non-fiction articles, reviews, and essays, along with a couple of unproduced movie scripts. He wrote for Batman: The Animated Series during its first emmy-award winning season, and during the second season, one of his scripts was nominated for an emmy for Outstanding Writing. His novelization of Star Wars: Shadows of the Empire spent ten weeks on The New York Times Bestseller List. He also did the bestselling novelization for the summer blockbuster movie Men in Black, and seven of his collaborative novels for Tom Clancy's Net Force series have made the NY Times list. For the past several years he has concentrated on books, and is currently working on his 54th novel.\r\n\r\nPerry is a member of various organizations, including: Science Fiction and Fantasy Writers of America; The Animation Guild, Local #839 (IATSE); Writers Guild of America, West; and the TriCounty Gun Club. He is a beginning student of the Indonesian martial art Penjak Silat, under Maha Guru Stevan Plinck, of Vancouver, Washington, and was a player in the largest guitar band ever assembled, according the Guiness Book of World Records.",
    "personal_name": "Steve Perry",
    "name": "Steve Perry",
    "key": "/authors/OL284230A",
    "alternate_names": [
        "Steven Carl Perry"
    ],
    "remote_ids": {
        "isni": "0000000109226039",
        "viaf": "88063748",
        "wikidata": "Q1368134"
    },
    "photos": [
        11118431,
        11083774,
        7284235
    ],
    "latest_revision": 18,
    "revision": 18,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2022-11-10T20:10:14.404674"
    }
}