{
    "name": "Marc Sumerak",
    "key": "/authors/OL2864492A",
    "type": {
        "key": "/type/author"
    },
    "photos": [
        11203280
    ],
    "links": [
        {
            "url": "https://www.sumerak.com/",
            "title": "author site",
            "type": {
                "key": "/type/link"
            }
        }
    ],
    "birth_date": "1978",
    "bio": {
        "type": "/type/text",
        "value": "Marc Sumerak began his writing career in the late 1990s as co-creator of the on-line comic book site, Abandoned Warehouse Press. While earning a BFA in Creative Writing at Bowling Green State University, Sumerak spent a semester as a Marvel Comics Editorial Intern. Soon after, Sumerak landed his first writing assignment -- AVENGERS CASEBOOK 1999.\r\n\r\nSumerak then joined the Marvel Comics staff, serving as Assistant Editor on over 500 comic book publications -- including runs on AVENGERS, FANTASTIC FOUR, THOR, IRON MAN and many more! Sumerak also edited a number of titles himself, including AGENT X, INHUMANS, and SENTINEL.\r\n\r\nAs a Writer, Sumerak is best known for his work on Marvel Comics' POWER PACK and the Eisner & Harvey Award nominated FRANKLIN RICHARDS: SON OF A GENIUS (with Chris Eliopoulos). Sumerak also created brand new series for Marvel in both GUARDIANS and MACHINE TEEN (whose antagonist, Holden Radcliffe, was featured on Marvel's AGENTS OF S.H.I.E.L.D. television show).\r\n\r\nIn 2011, Sumerak released ALL-GHOULS SCHOOL -- an original all-ages graphic novel from IDW Publishing.\r\n\r\nShifting his focus to video games, Sumerak began providing story content for the popular mobile game, MARVEL FUTURE FIGHT, in 2017. He wrote the story and script for MARVEL ULTIMATE ALLIANCE 3: THE BLACK ORDER, released for the Nintendo Switch in July, 2019. He is currently writing the upcoming mobile RPG, MARVEL FUTURE REVOLUTION.\r\n\r\nSumerak continues to write comics, books, and games for some of pop culture's most recognizable franchises -- including STAR WARS, HARRY POTTER, FIREFLY, GHOSTBUSTERS, BACK TO THE FUTURE, and THE OFFICE.\r\n\r\nWith an eye on the future of the industry he loves, Sumerak provides script critiques and serves as a mentor for Comics Experience and instructs the Graphic Narratives course at the Cleveland Instiute of Art.\r\n\r\nSumerak resides in Cleveland, OH."
    },
    "latest_revision": 3,
    "revision": 3,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-29T15:03:11.581851"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2021-06-01T15:43:17.440055"
    }
}