{
    "bio": {
        "type": "/type/text",
        "value": "Linda S. was born August 3, 1950 in Gadsden, Alabama, U.S.A.. She cut her teeth on Margaret Mitchell, Robert Ruark, \"and anything else that fell into my hands,\" she says. Whether she is reading them or writing them, books have long played a profound role in Linda's life. Linda wrote her first book when she was 10 years old. \"Needless to say, it was unpublishable,\" she says. \"It didn't even have a title. I didn't name them back then.\"\r\n\r\nIn the ensuing 21 years of writing for her own pleasure, following junior college Linda worked in the transportation industry, where she met Gary F. Howington, her husband. \"In the company I worked for, my title was secretary to the terminal manager, but I actually did very little secretarial work,\" she says. \"I worked in every phase of the transportation business, but my main duties were payroll, insurance, and the efficiency and production reports.\" Writing production reports, however, soon grew tiresome for Linda.\r\n\r\nAs she continued to write fiction, concentrating on romantic stories. \"I get bored with politics and murder and mayhem,\" she says. She eventually worked up the courage to submit a manuscript for publication. \"It made me sick literally, physically ill. It was like putting your naked baby into the mailbox. And I lost 20 pounds waiting to hear from them. I couldn't eat.\" Linda needn't have worried Silhouette Books bought her manuscript, beginning a career that has (so far) lasted over 10 years and earned her many awards and letters of praise from adoring fans. She has over 10 million books in print around the world, and has written more than 25 titles. Linda has written for Silhouette Special Edition and continues to write for Silhouette Sensation, and is a New York Times bestselling author for Pocket Books writing historicals.\r\n\r\nLinda Howard is a charter member of RWA, joining in 1981 shortly after it was formed. She is one of the original members of her local RWA chapter, has served as treasurer, vice president, and president of that chapter, and has twice been a RITA finalist. In addition to her wide public acclaim, Linda has also been honored by both the critics and her peers many times. She has won the B. Dalton Bestseller Award and the Romantic Times Magazine Reviewers' Choice Award for Series and the W.I.S.H. Award for hero Joe Mackenzie from her Silhouette Intimate Moments title, Mackenzie's Mission. A tie-in book, Mackenzie's Pleasure, reached number 61 on the USA Today bestseller list. A Romance Writers of America RITA and Golden Choice finalist, she is a frequent Waldenbooks bestselling author, often claiming the number-one position.\r\n\r\nNow, Linda has three grown step-children and three grandchildren. She lives in her native Alabama with her husband Gary and two golden retrievers, named Bit O'Honey and Sugar Baby. They live in in a big house that's very much a home and not a showplace. \"It's a house where the kids romp, the dogs romp, and you can sit on any piece of furniture. Her husband fishes BassMaster tournament trail for a living, and she travels with him.\""
    },
    "name": "Linda Howard",
    "personal_name": "Linda Howard",
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "alternate_names": [
        "Linda S Howington",
        "Howard, Linda, 1950-"
    ],
    "photos": [
        6457665,
        -1
    ],
    "last_modified": {
        "type": "/type/datetime",
        "value": "2020-09-27T03:56:36.554563"
    },
    "latest_revision": 10,
    "key": "/authors/OL30714A",
    "birth_date": "3 August 1950",
    "revision": 10,
    "type": {
        "key": "/type/author"
    },
    "remote_ids": {
        "viaf": "5051471",
        "wikidata": "Q446121",
        "isni": "0000000115880846"
    }
}