{
    "name": "Elizabeth Goudge",
    "bio": {
        "type": "/type/text",
        "value": "Elizabeth de Beauchamp Goudge was born on 24 April 1900 in the cathedral city of Wells, where her father, a clergyman, was vice-principal of the Theological College. When she was a child, the family moved to Ely and then to Oxford. Elizabeth attended Grassendale School and studied art at University College Reading. She went on to teach design and handicrafts in Ely and Oxford. Her first book, The Fairies' Baby and Other Stories (1919) was considered unsuccessful, but her first novel, Island Magic (1934) was an immediate hit. She was a best-selling author in both the UK and the USA from the 1930s through the 1970s. Elizabeth Goudge won the annual Carnegie Medal from the Library Association for The Little White Horse in 1946; it inspired the British television mini-series Moonacre and the film The Secret of Moonacre. Green Dolphin Country (1944) was adapted as a film in 1948 under the title Green Dolphin Street. After her mother's death in 1951, Elizabeth Goudge moved to a cottage on Peppard Common, just outside Henley-on-Thames, where she lived for the last 30 years of her life. She became a founding member of the Romantic Novelists' Association in 1960 and later served as vice president. She died on 1 April 1984."
    },
    "personal_name": "Goudge, Elizabeth",
    "death_date": "1 April 1984",
    "alternate_names": [
        "Elizabeth de Beauchamp Goudge",
        "Elizabeth Goudge",
        "Elisabeth Goudge"
    ],
    "photos": [
        7304705,
        7304704,
        6288498
    ],
    "birth_date": "24 April 1900",
    "type": {
        "key": "/type/author"
    },
    "remote_ids": {
        "viaf": "24602168",
        "wikidata": "Q242571",
        "isni": "0000000108792469"
    },
    "links": [
        {
            "url": "http://www.elizabeth-goudge.com/",
            "title": "Website",
            "type": {
                "key": "/type/link"
            }
        }
    ],
    "key": "/authors/OL37752A",
    "latest_revision": 16,
    "revision": 16,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2024-04-22T22:24:00.871889"
    }
}