{
    "bio": "**Born** \tJoseph Henry Delaney\r\n                25 July 1945\r\n                Preston, Lancashire, England, U.K.\r\n**Alma mater** \tLancaster University\r\n\r\n**Life and career**\r\n\r\nOn first leaving school, Delaney started work as an apprentice engineer. Upon the completion of his schooling, he went on to become an English instructor, with his initial literary specialization being in the area of vampire lore. In his capacity as an educator, he worked to establish the Media and Film Studies department at Blackpool Sixth Form College.[3]\r\n\r\nHis writing career began with the release of a sci-fi book, written under the pen-name of J.K. Haderack. This was followed up by releases under his real name, including his first children's novel, which was in part based upon actual experiences and memories he had as a youth. Additional works were produced to expand that single work into a series of titles tailored primarily at Young Adult and Adult Fiction audiences. The books that he wrote after his first pen-name book were The Wardstone Chronicles.\r\n\r\nDelaney retired from his position as an educator in order to devote his energies to a full-time writing career. He has three children and seven grandchildren.\r\n\r\n----------\r\n\r\nJoseph Henri Delaney est un auteur anglais de science fiction et d’Heroic Fantasy, qui fut professeur d’anglais spécialisé en littérature vampirique. Sa carrière d’écrivain a commencé avec le livre « Mercer’s Whore » sous le pseudonyme de « J.K. Haderack ». Il a ensuite commencé à écrire sous son véritable nom le cycle « The Last Apprentice » (en français « Le dernier apprenti »). \r\nIl a aussi écrit la série de livres de l’Épouvanteur.\r\n\r\nIl est surtout spécialisé dans les romans de jeunesse et principalement connu pour son œuvre The Wardstone Chronicles (Les Chroniques de la pierre des Ward).\r\n\r\nIl vit en Angleterre avec sa famille dans le Lancashire, où il puise son inspiration pour son œuvre. Il a trois enfants et sept petits-enfants.",
    "name": "Joseph Delaney",
    "personal_name": "Joseph Delaney",
    "alternate_names": [
        "J.K. Haderack",
        "Joseph H. Delaney"
    ],
    "photos": [
        7134532
    ],
    "key": "/authors/OL5159023A",
    "birth_date": "25 July 1945",
    "type": {
        "key": "/type/author"
    },
    "remote_ids": {
        "viaf": "257542905",
        "wikidata": "Q2481988",
        "isni": "0000000068488779"
    },
    "death_date": "16 August 2022",
    "latest_revision": 8,
    "revision": 8,
    "created": {
        "type": "/type/datetime",
        "value": "2008-09-26T16:32:32.890097"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2025-05-09T06:53:43.816106"
    }
}