{
    "bio": "Sherrilyn Kenyon, known as Sherri, was born on 11 December 1965 in Columbus, Georgia, USA. She grew up in the middle of a very big family, she had eight brothers and one sister. Her father left the family when she was only eight, and her mother was forced to send her sons to live with family in Atlanta, Georgia, while she took care of her daughters, because Sherri's older sister, Trish, has severe cerebral palsy. After 18 months, the girls could moved to Atlanta  with the rest of the family.  At 20, Sherri was devastated when her brother Buddy died.\r\n \r\nSherri is is severely dyslexic, but even as a child Kenyon knew that she wanted to be a writer. In kindergarten, she wrote in her Brownie manual that she wanted to be a writer and a mother when she grew up. Her first recognition for her writing came when she won a contest in third grade by writing an essay about her mother for Mother's Day. At 7, she wrote and illustrated her first novel, a horror story about a girl who kills her brothers. At 14, she made her first professional sale, and continued to write for school newspapers, yearbooks, local papers and magazines throughout high school.\r\n \r\nSherri gained her \"love of all things that go bump in the night\" from her mother, who loved paranormal storylines and never censored what movies the young girl was allowed to watch with her. When, she was in high school, she started to writing fantasy stories for herself. When in the mid-1980s, she for a small science fiction magazine called Cutting Edge, her boss asked her to write a long-running serial for the magazine. She brought many of her favorite characters from her previous fantasies into one larger series. This was the start of the Hunter-Leyends world, which later became the Dark-Hunters, Were-Hunters and Dream-Hunters stories. Many of the first Dark-Hunter heroes first appeared in her teenager stories. In this series, she has created an entire universe, the rules of which are maintained solely in her head. The books focus on an ancient \"Pyramid of Protection that the ancient Greek gods formed to protect the human race from supernatural predators and to protect the order of the universe.\"\r\n \r\nSherri graduated with an interdisciplinary major that combined Medieval History and language with Classical Studies, after dabbling in a total of twelve majors, she had enough credits to also earn minors in Philosophy, Psychology, and French, and to earn a certificate of Medieval Studies.\r\n \r\nSherri married very young, and the couple moved to Richmond, Virginia, where her husband continued to study. Meanwhile, she was unable to find a job of any kind before a childhood friend mentioned that the magazine she was editing needed several articles written. Only two years later she sold her first book, with five more sales coming quickly, and she won several awards and had high sell-throughs. Then everything collapsed. After the publication of her sixth novel she found herself unable to get a writing contract. Her father died in February 1995, and she was unable to work for a very difficult pregnancy and her baby spend six weeks in the neo-natal intensive care unit. Later the same year, her mother was diagnosed with cancer, and Sherri became pregnant again, having to be hospitalized for the majority of the time. Once her second baby was born and she was able to work again, she took a minimum wage job working as a web designer to help pay the bills, still writing at every spare moment, and she finished, Fantasy Lover, the manuscript that she had begun in the hospital. In 1997, she began dreaming up the details of a pirate novel. This book was very different from her previous works, so she chose to use a pseudonym, Kinley MacGregor, which is the maiden name of her great-grandmother. Finally she found a publisher interested in vampire romances and managed to sell their Hunters.\r\n \r\nSherrie loves the music an in her spare time, she plays the guitar, flute, piano, and the drums. She also is very interested in martial arts and sword-fighting. She even spent time as a sparring partner for a Golden Glove boxer and has a collection of swords, that everyone has a major fixation with. Her website is one of the most completes and interactives.\r\n \r\nMarried with three sons, Sherrie lives outside of Nashville, Tennessee, with her family and an assorted menagerie of pets.",
    "remote_ids": {
        "wikidata": "Q446209",
        "viaf": "47823214",
        "isni": "0000000116361888"
    },
    "name": "Sherrilyn Kenyon",
    "key": "/authors/OL589683A",
    "alternate_names": [
        "Kinley MacGregor",
        "Sherrilyn McQueen",
        "Sherrilyn Woodward McQueen"
    ],
    "birth_date": "11 December 1965",
    "type": {
        "key": "/type/author"
    },
    "links": [
        {
            "title": "Author website",
            "url": "https://www.sherrilynkenyon.com/",
            "type": {
                "key": "/type/link"
            }
        }
    ],
    "source_records": [
        "amazon:1538526581",
        "amazon:0739438778",
        "amazon:2290344796",
        "promise:bwb_daily_pallets_2022-03-17",
        "promise:bwb_daily_pallets_2020-08-24",
        "promise:bwb_daily_pallets_2020-04-30",
        "promise:bwb_daily_pallets_2023-01-04",
        "promise:bwb_daily_pallets_2022-05-23"
    ],
    "personal_name": "Sherrilyn Kenyon",
    "photos": [
        6962015,
        14388867
    ],
    "latest_revision": 9,
    "revision": 9,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2023-07-24T09:36:23.722767"
    }
}