{
    "name": "Graham Diamond",
    "bio": {
        "type": "/type/text",
        "value": "In 2015 and 2016 Endeavour PRESS UK, and Venture Press UK, contracted for 15 of Graham Diamond's well known books. Available worldwide through kindle, the titles include the cult classic, THE HAVEN.  \r\n\r\nIn summer of 2017 Venture Press UK acquired digital rights to FOREST WARS, an epic fantasy based on the story of THE HAVEN.\r\n\r\nIn addition the EMPIRE PRINCESS series of LADY OF THE HAVEN, DUNGEONS OF KUBA, FALCON OF EDEN, BEASTS OF HADES became available both individually as well as a boxed omnibus.\r\n\r\nSAMARKAND and SAMARKAND DAWN were also released as a two volume set as well as individually.\r\n\r\nTHE THIEF OF KALIMAR, another bestselling title was released in 2016, as was the acclaimed CAPTAIN SINBAD, MARRAKESH and MARRAKESH NIGHTS.  CINNABAR and the noted CHOCOLATE LENIN helped fill out the list.\r\n\r\nEndeavour PRESS UK also released the bestselling BLACK MIDNIGHT thriller, and CRY FOR FREEDOM, the renown story of the Zulu War of 1879 in South Africa.\r\n\r\n\r\n\r\n**CHOCOLATE LENIN** by **Graham Diamond**\r\n\r\nA satire/thriller set in the near-future, a brilliant but crazed scientist in a chocolate factory recreates the historical revolutionary Vladimir Ilyich Lenin, and restores him back to life. As a new revolution threatens to hurl the world into chaos, an elite but very quirky security team is formed to end the madness before pandemonium starts. \r\nA unique and humorous look at today's contemporary world of technology and science, Chocolate Lenin will leave you laughing and moved at the same time. Graham Diamond has blended history, fantasy, and adventure into a single, mind boggling tale that will leave you spellbound.\r\n\r\n\r\nGraham Diamond began writing as a fantasy and science fiction author. He was born in Manchester, England, after World War II, and his family moved to the United States when he was a young child. He was raised in New York City, on the Upper West Side, and graduated from the High School of Music and Art. He attended CCNY in NY, and the Art Students League of New York.\r\nA fine arts major, Diamond turned to professional writing in his late twenties and is now is best known for books such as The Haven, Lady of the Haven , The Thief of Kalimar, Black Midnight, and Forest Wars, Marrakesh, Samarkand, Samarkand Dawn. He soon turned to other genres, including historical fiction, thrillers, and  a true story of a Holocaust survivor's family during World War II, Maybe You Will Survive (Holocaust Press, 1991). Several of his books were published in the UK by Methuen.\r\nUnder the pen name Rochelle Leslie (the names of his two daughters), he authored Tears of Passion, Tears of Shame, a novel of South Africa set during the Zulu War of 1879, which was subsequently published in Italy, titled, Venuto De Lontano, (To Come From Far Away) by Mondadori. He also has had various short stories published in anthologies. In addition to his numerous novels and non fiction books, he was employed as an editorial artist and production manager by the **New York Times** for many years, and has also taught creative writing in both New York and California. He regularly volunteers and lectures at public libraries and schools across the United States. \r\nBeginning  autumn of 2007 a number of Diamond's novels, beginning with **Forest Wars**, **The Thief of Kalimar**, **Black Midnight**, and Lady of the Haven, were reissued. \r\nDiamond currently divides him time between California and New York. He is also working on another novel.\r\n[edit]Select bibliography\r\n\r\nCaptain Sinbad\r\nCinnebar \r\nMarrakesh Nights \r\nThe Falcon of Eden \r\nBeasts of Hades \r\nOutcasts \r\n\r\n[edit]External links\r\n\r\n**Science Fiction&Fantasy Writers of America, active member\r\nPoets&Writers\r\nGraham Diamond at the Internet Speculative Fiction Database**"
    },
    "personal_name": "Graham Diamond",
    "alternate_names": [
        "Rochelle Leslie (1st edition of Tears of Passion, Tears of Shame, Berkley/Jove)"
    ],
    "photos": [
        7236755,
        6688281,
        6451009
    ],
    "type": {
        "key": "/type/author"
    },
    "remote_ids": {
        "viaf": "43349541",
        "wikidata": "Q5592774",
        "isni": "0000000026889275"
    },
    "links": [
        {
            "url": "http://blog.360.yahoo.com/blog-MTqhgwo2aafntvT1saHp7KUf_sb_12a4dx_jrfk1sa61Pn4-?cq=1&p=2",
            "title": "Website",
            "type": {
                "key": "/type/link"
            }
        }
    ],
    "key": "/authors/OL595024A",
    "latest_revision": 15,
    "revision": 15,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2025-01-13T15:55:39.743298"
    }
}