{
    "remote_ids": {
        "viaf": "56745216",
        "isni": "0000000071436750",
        "wikidata": "Q1995311"
    },
    "personal_name": "Christopher Golden",
    "photos": [
        11118598
    ],
    "bio": "CHRISTOPHER GOLDEN is the award-winning, bestselling author of such novels as The Myth Hunters, Wildwood Road, The Boys Are Back in Town, The Ferryman, Strangewood, Of Saints and Shadows, and (with Tim Lebbon) The Map of Moments. He has also written books for teens and young adults, including Poison Ink, Soulless, and the thriller series Body of Evidence, honored by the New York Public Library and chosen as one of YALSA’s Best Books for Young Readers. Upcoming teen novels include a new series of hardcover YA fantasy novels co-authored with Tim Lebbon and entitled The Secret Journeys of Jack London.\r\n\r\nA lifelong fan of the “team-up,” Golden frequently collaborates with other writers on books, comics, and scripts. In addition to his recent work with Tim Lebbon, he co-wrote the lavishly illustrated novel Baltimore, or, The Steadfast Tin Soldier and the Vampire with Mike Mignola. With Thomas E. Sniegoski, he is the co-author of multiple novels, as well as comic book miniseries such as Talent and The Sisterhood, both currently in development as feature films. With Amber Benson, Golden co-created the online animated series Ghosts of Albion and co-wrote the book series of the same name.\r\n\r\nAs an editor, he has worked on the short story anthologies The New Dead and British Invasion, among others, and has also written and co-written comic books, video games, screenplays, the online animated series Ghosts of Albion (with Amber Benson) and a network television pilot.\r\n\r\n\r\nThe author is also known for his many media tie-in works, including novels, comics, and video games, in the worlds of Buffy the Vampire Slayer, Hellboy, Angel, and X-Men, among others.\r\n\r\nGolden was born and raised in Massachusetts, where he still lives with his family. His original novels have been published in fourteen languages in countries around the world.",
    "key": "/authors/OL66055A",
    "alternate_names": [
        "Golden, Christopher",
        "christopher Golden",
        "Christopher Golden",
        "Christopher (Editor) Golden",
        "Chris Golden"
    ],
    "source_records": [
        "amazon:1587671956",
        "amazon:1536624721",
        "amazon:1531885349"
    ],
    "name": "Christopher Golden",
    "type": {
        "key": "/type/author"
    },
    "birth_date": "15 July 1967",
    "latest_revision": 11,
    "revision": 11,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2022-03-31T20:11:57.977509"
    }
}