{
    "bio": {
        "type": "/type/text",
        "value": "Valjeanne Jeffers is a graduate of Spelman College and North Carolina Central University and a member of the Carolina African American Writer’s Collective. Her writing has been published in The Obamas: Portrait of America’s New First Family: From the Editors of Essence. \r\n\r\nHer poems have been published (under the pen name Valjeanne Jeffers-Thompson) in Revelry 2006, The Ringing Ear: Black Poets Lean South 2007, Drumvoices Revue, Say It Loud: Poems About James Brown, Liberated Muse I: How I Freed My Soul, Volume I (as Valijeanne Jeffers) and she was one of the 2007 semifinalists for the Rita Dove Poetry Award. \r\n\r\nValjeanne's poetry and fiction have also appeared in Pembroke Magazine Volume 39. Her short stories has been published in Griots: A Sword and Soul Anthology, Genesis Science Fiction Magazine, Genesis: A Black Science Fiction Anthology, PurpleMag numbers 7, 8 and 9, LuneWing, 31 Days of Steamy Mocha, Griots II: Sisters of the Spear, Steamfunk! and Possibilties (all under the pen name Valjeanne Jeffers). \r\n\r\nValjeanne works as an editor for Mocha Memoirs Press, LLC and as a freelance editor.\r\n\r\nHer novels are available at Nubian Bookstore Morrow GA\r\nElajy's Used Books Pittsburgh PA\r\nThe Wild Fig Bookstore Lexington KY\r\nBarnes and Noble and Amazon\r\n\r\nPreview or purchase her novels at[link text][1] www.vjeffersandqveal.com\r\n\r\n\r\n  [1]: http://www.vjeffersandqveal.com"
    },
    "name": "Valjeanne Jeffers",
    "links": [
        {
            "url": "http://www.vjeffersandqveal.com",
            "type": {
                "key": "/type/link"
            },
            "title": "Valjeanne's site"
        }
    ],
    "created": {
        "type": "/type/datetime",
        "value": "2010-07-05T01:45:07.077684"
    },
    "alternate_names": [
        "Valjeanne Jeffers-Thompson"
    ],
    "photos": [
        6450108
    ],
    "last_modified": {
        "type": "/type/datetime",
        "value": "2012-11-07T22:18:43.823547"
    },
    "latest_revision": 26,
    "key": "/authors/OL6821009A",
    "birth_date": "9/24",
    "type": {
        "key": "/type/author"
    },
    "revision": 26
}