{
    "bio": {
        "type": "/type/text",
        "value": "**Nancy Temple Rodrigue** lives in the small town of Lompoc, California, where she writes her novels. Besides writing, Nancy enjoys driving her award-winning 1957 T- Bird and showing it at Car Shows. \r\n\r\nWriting about her favorite park, Disneyland, comes easy for Nancy as she has been an avid Disney fan ever since she was 6 years old and went to Disneyland for the first time. Her novels show her admiration and respect for the man who started it all–Walt Disney.\r\n\r\nThe start of the Disney themed novels is *HIDDEN MICKEY: Sometimes Dead Men DO Tell Tales!* Most are hooked immediately, and then devour all the other books... *HIDDEN MICKEY 2: It All Started…*,* HIDDEN MICKEY 3 Wolf!: The Legend of Tom Sawyer’s Island*, and finally *HIDDEN MICKEY 4 Wolf!: Happily Ever After?.*\r\n\r\nFans asked, and Nancy listened! She continues the story line with *HIDDEN MICKEY ADVENTURES 1: Peter and the Wolf*, *HIDDEN MICKEY ADVENTURES 2: Peter and the Missing Mansion*, *HIDDEN MICKEY ADVENTURES 3: The Mermaid's Tale*, *HIDDEN MICKEY ADVENTURES 4: Revenge of the Wolf*, and *HIDDEN MICKEY ADVENTURES 5: When You Wish* (coming summer 2016). \r\nThese adventure-mysteries were written for all ages, 9 and up.\r\n\r\n**BEST SELLERS at Disney D-23 Expo 2011 - 2013 - 2015, as well as the L A Times Festival of Books 2011 - 2013**\r\n\r\nNancy also wrote an acclaimed romantic fantasy: THE FAN LETTER. It's a great light and fun read! \r\n\r\nNancy actively participates in book signings and speaking events, and she loves talking to people who enjoy her novels. Readers can visit HiddenMickeyBook.com or DoubleRbooks.com to follow her blog and learn where book signing event dates and locations are posted. Readers can also follow Nancy on Facebook (HiddenMickeyFanClub), Twitter (Hidden_Mickey), and Google+ (HiddenMickeyFanClub)"
    },
    "links": [
        {
            "url": "http://double-Rbooks.com/authors/Nancy_Temple_Rodrigue.html",
            "type": {
                "key": "/type/link"
            },
            "title": "author page"
        }
    ],
    "photos": [
        7268390,
        6681341
    ],
    "last_modified": {
        "type": "/type/datetime",
        "value": "2015-12-02T02:38:20.236387"
    },
    "latest_revision": 10,
    "key": "/authors/OL6807973A",
    "name": "Nancy Temple Rodrigue",
    "created": {
        "type": "/type/datetime",
        "value": "2010-05-11T15:13:31.404127"
    },
    "birth_date": "1956",
    "type": {
        "key": "/type/author"
    },
    "revision": 10
}