{
    "key": "/authors/OL716700A",
    "death_date": "2024",
    "bio": "**Francine Pascal**, a native New Yorker, is an author best known for creating the Sweet Valley series of young adult novels. Sweet Valley High was the backbone of the collection, and was made into a popular television series. There were also several spin-offs, including The Unicorn Club, Sweet Valley University, and Sweet Valley Sorority.<p></p>\r\n\r\nFrancine Rubin graduated from New York University in 1958. It was there that she first met author and journalist [John Pascal][1] and, in 1965, they were married (the second marriage for each). Francine often credited John as her writing mentor, and they collaborated on several projects, including writing scripts for the ABC soap opera *The Young Marrieds*, which aired from 1964 - 1966. John died of cancer in 1981, at 49 years old.<p></p>\r\n\r\nFrancine's brother was the prolific Broadway playwright and librettist [Michael Stewart][2], who wrote the books to such Broadway musical hits as *Bye Bye Birdie*, *Hello, Dolly!*, and *42nd Street*. Francine, her husband John, and her brother Michael worked together writing the book to the Broadway musical *George M!*, which ran at the Palace Theatre from 1968 - 1970. A television version of *George M!* was aired on NBC in 1970.<p></p>\r\n\r\nMichael Stewart died in 1987. Since then, Francine has revised his musical *Mack & Mabel*. She has also worked on the revision of another of his musicals, *Carnival!*, for the Kennedy Center in Washington.<p></p>\r\n\r\nFrancine's first young adult novel, published in 1977, was called *Hangin' Out with Cici*, in which her heroine, Victoria Martin, went back in time and met her mother as a teenager. It was televised as an ABC After-School Special entitled *My Mother Was Never a Kid*. She has written two other Victoria Martin books: *My First Love and Other Disasters*, and *Love and Betrayal & Hold the Mayo*. Another of her early novels, *The Hand-Me-Down Kid*, was also made into an ABC After-School Special.<p></p>\r\n\r\nMore recent works include the Caitlin series, a set of three trilogies which follows a teenage girl into adulthood, as well as a second mass-market project, the young adult fantasy spy series Fearless and its spin-off, Fearless: FBI. A TV series was also planned for Fearless, but for several reasons it never aired.<p></p>\r\n\r\n*The Ruling Class*, a teen novel about a clique of spectacularly cruel girls who essentially run a high school in a wealthy Dallas suburb, was described in a Fantastic Fiction review as \"a magnetic tour de force created by a master storyteller at the top of her form.\"<p></p>\r\n\r\nIn addition to her work for mostly female teens, Francine has written some adult fiction books, including *La Villa* (originally published as *If Wishes Were Horses*) and *Save Johanna!*, as well as a non-fiction book, *The Strange Case of Patty Hearst*, which she wrote with her husband John. (Although *La Villa* was billed as fiction, it has been suggested that it may have been based in part upon true experiences of the author and her late husband. Without further corroboration, however, this can be considered no more than conjecture.)<p></p>\r\n\r\nJohn and Francine Pascal lived in Manhattan with Francine's three daughters from her first marriage: Jamie, Laurie, and Susan. (John had a son from his first marriage, Matthew, who lived with his mother.) After John died, Francine and her daughters remained in Manhattan, and Francine has been quoted as saying that much of the inspiration for her young adult novels came from watching her own three daughters grow up.<p></p>\r\n\r\nSadly, in 2008, Francine's oldest daughter Jamie died after a two-year battle with liver disease.<p></p>\r\n\r\nFrancine Pascal now divides her time between homes in New York and the south of France. Since John died, she has never remarried.\r\n\r\n\r\n  [1]: http://openlibrary.org/authors/OL6784290A/John_Pascal\r\n  [2]: http://openlibrary.org/authors/OL6784289A/Michael_Stewart",
    "name": "Francine Pascal",
    "photos": [
        6293691
    ],
    "type": {
        "key": "/type/author"
    },
    "personal_name": "Francine Pascal",
    "alternate_names": [
        "Fran Pascal",
        "Francine P. Pascal",
        "francine pascal",
        "FRANCINE PASCAL"
    ],
    "birth_date": "13 May 1938",
    "remote_ids": {
        "viaf": "12319102",
        "wikidata": "Q4349073"
    },
    "source_records": [
        "bwb:9780593576991",
        "promise:bwb_daily_pallets_2022-06-14",
        "promise:bwb_daily_pallets_2022-03-17",
        "promise:bwb_daily_pallets_2020-11-19",
        "promise:bwb_daily_pallets_2022-12-23",
        "promise:bwb_daily_pallets_2022-12-22",
        "amazon:0553400789",
        "bwb:9780553540512",
        "promise:bwb_daily_pallets_2023-12-05:P9-AHX-422",
        "bwb:9781548213176"
    ],
    "links": [
        {
            "title": "Website",
            "url": "http://www.randomhouse.com/author/results.pperl?authorid=23290&view=full_sptlght",
            "type": {
                "key": "/type/link"
            }
        }
    ],
    "latest_revision": 29,
    "revision": 29,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2024-11-30T04:06:57.924289"
    }
}