{
    "bio": {
        "type": "/type/text",
        "value": "Matthew Chivers (1985-present) was born in Bath, United Kingdom. His father is English and his mother half English & Greek. Matthew currently lives in Wiltshire as he continues to work on his series \"Approaching the Dark Age\", while also working as a full time receptionist at a local hotel in Chippenham, Wiltshire. \r\n\r\nAn Aphasic and Dyslexic sufferer, Matthew continues to gain recognition for his self-published works, regardless of speech, reading and writing impediments.\r\n\r\nMatthew's first book, Approaching the Dark Age - Resonance (May 2011) sets the pace for the series. Primarily focused on Science-Fiction with a blend of Fantasy, his novels focus on the earth having experienced the end of the world. Set over a 150 years into the future, mankind has retreated to barbaric or spiritual ways in order to overcome the day to day life. \r\n\r\nResonance begins with the focus on a male protagonist known as Maledream, who belongs to a Tribe in which his foster father, Larkham, adopted him as a child in the nearby war-torn city many years ago. One day, after a row with Larkham, Maledream heads off on what is to be another uneventful day. \r\n\r\nHowever, he soon comes across the female protagonist in the series known as Angelite, a priestess of the Order of Spirit. The two meet after Maledream discovers her in a ruined library, trapped, and under attack by a vicious monster known as an Anunaki. After taking it upon himself to come to her rescue, the two fight it. From here on out, Maledream & Angelite set off on a dangerous journey.\r\n\r\nAs the first in the series, Resonance is also a platform for Matthew's \"Magic\" system, which in itself is called \"Resonance\". Matthew describes that the magic, known as Resonance, has a scientific basis.\r\n\r\nMatthew says on Resonance:\r\n\"I have tried to opt for something different that many fantasy novels do not delve into. How does \"magic\" happen? It is all well and good for a \"Wizard\" to chant some words and blow something up with a fireball, but how is this achieved, really? To me, there is no imaginative thought involved in that. \r\n\r\nIt almost feels like cheating to me. It is quite often never explained in any fantasy story, no matter how well written it is or who it is by. It just happens. Bam. No thought involved what so ever, and I feel it generally just undermines our human intelligence. As much as I love the fantasy genre, I wanted to go in a different direction with my creativity, and I certainly wanted to involve science fiction to enhance many more aspects of the Approaching the Dark Age universe to increase the flavor. \r\n\r\nI wanted to not only explain how my \"magic system\" works by explaining it with science, I also wanted it to be a fundamental part of my series and universe, the fabric of the world that my characters exist in. Therefore, this is what my first books sub-title is all about - Resonance - the fabric of magic through the science of sound. Science understands today that Atoms are 99% hollow, they consist of a nucleus and then some charged particles that float around in orbit around it - so what about that empty space? \r\n\r\nIf atoms are hollow, then how do we exist? This is where \"Resonance\" comes into it in my books. Atoms aren't hollow as such, but merely appear to be - what fills that space is the \"Sound\" or \"Resonance\" echoing inside the atom, locked in place by the charged particles such as photons, etc. \r\n\r\nSo, by merely changing the \"frequency\" of those sound waves, you can alter the composition of the atom - the general \"magical\" term for this is \"Resonance\" in the Approaching the Dark Age universe, hence the name of the first book. I feel that this gives my story both a fantasy feel with a solid magic system, and a scientific, plausible basis for all magic in my universe. \r\n\r\nOkay, it sounds simple, but in my books I go into far more detail as the series progresses. I keep pushing the boundaries, keep it progressive, going into far more detail. What I gave you is just the barebones example of the Resonance/Magic system in the ADA Series.\"\r\n\r\nThe second novel: Approaching the Dark Age - Orchestra (November 2011), continues from where the first novel, Resonance, finished. Following on from the first book, Maledream and Angelite embark on another journey that takes them from the protective walls of Meridia. \r\n\r\nWith their friends, Neveah, Crazy John, Boris and the wolf known as Silver, they start their journey by traversing over the ocean and back to the ruined city where Maledream started his journey over a month ago, in search of crystal objects known as the Skulls of Meridia. \r\n\r\nTo do this quickly and safely, the adventurers ride in a special silver craft, an ancient vehicle constructed by the fabled \"Creators\". Installed with an engine interface known as the \"Dream-State-Drive\", or \"DSD\" for short, this enables the adventures to traverse vast distances to help them in their quest for the Skulls of Meridia.\r\n\r\nThe third novel: Approaching the Dark Age - Echo (May 2012), continues on from Orchestra. Matthew places further emphasis and awareness on Aphasia and Dyslexia in his writings, and how the disability can affect someone who lives with it. A person suffering with Aphasia may find speaking, reading and writing extremely difficult, and so the Author goes into some detail on how a sufferer can seek further help and advice in his paperback novel and on his website.\r\n\r\nMatthew seeks to continue the series after the third, and has announced on his website that writing has begun on the first chapter of Approaching the Dark Age - Distortion, continuing from where Echo finished. In July 2012, Matthew announced on his book series Facebook page that he is aiming to make Distortion his biggest novel yet, and has set a target of 150,000 words (Orchestra is the largest at 131,000 words)."
    },
    "photos": [
        7247487
    ],
    "last_modified": {
        "type": "/type/datetime",
        "value": "2013-01-07T08:17:20.845448"
    },
    "latest_revision": 3,
    "key": "/authors/OL7167752A",
    "name": "Matthew Chivers",
    "created": {
        "type": "/type/datetime",
        "value": "2013-01-07T08:08:53.187448"
    },
    "death_date": "-",
    "birth_date": "11/05/1985",
    "type": {
        "key": "/type/author"
    },
    "revision": 3
}