{
    "fuller_name": "Inez Leonore Haynes Gillmore Irwin",
    "alternate_names": [
        "Inez Haynes Irwin",
        "Inez Haynes Gillmore",
        "Inez Gillmo",
        "Inez Gillmore",
        "Inez Irwin",
        "Inez Haynes Gilmore",
        "inez haynes irwin",
        "Inez Haynes Inez Haynes Gillmore"
    ],
    "name": "Inez Haynes Gillmore",
    "source_records": [
        "bwb:9798589532760",
        "bwb:9798454552886",
        "bwb:9781377316871",
        "marc:marc_columbia/Columbia-extract-20221130-004.mrc:471524751:522",
        "promise:bwb_daily_pallets_2024-09-03:W9-CID-538",
        "bwb:9781722389031",
        "bwb:9781501085901"
    ],
    "death_date": "1970",
    "personal_name": "Inez Haynes Gillmore",
    "remote_ids": {
        "viaf": "45765635",
        "wikidata": "Q6028696",
        "isni": "0000000084504329"
    },
    "bio": {
        "type": "/type/text",
        "value": "Inez Haynes was born in Rio de Janeiro, Brazil, in 1873, the daughter of Gideon and Emma Jane (Hopkins) Haynes. Her parents, who were from Boston, returned to the U.S. during her childhood and she was raised in Boston. In 1897 she married her first husband, Rufus Hamilton Gillmore, a newspaperman who supported her feminism. While at Radcliffe (1897-1900), she became involved in the women's suffrage movement. Her first novel, June Jeopardy, was published in 1908. Her first marriage ended in divorce, and in 1916 she married writer Will Irwin. During World War I, she and her husband served as war correspondents in France, England and Italy. She was awarded the O. Henry Award for her short story \"The Spring Flight\" (1924). In 1948, her second husband died, and she relocated to Scituate, Massachusetts.\r\n\r\nIn addition to her popular Maida series of children's books, she wrote novels and short stories. Her fiction often dealt frankly with feminist concerns and women’s social issues, including divorce, single parenthood and workplace issues. She also wrote mysteries, and other books, including an etiquette book for girls, a travel book about California, and “Angels and Amazons: A Hundred Years of American Women”, a collection of biographical sketches."
    },
    "birth_date": "1873",
    "type": {
        "key": "/type/author"
    },
    "key": "/authors/OL947807A",
    "photos": [
        5545574
    ],
    "latest_revision": 7,
    "revision": 7,
    "created": {
        "type": "/type/datetime",
        "value": "2008-04-01T03:28:50.625462"
    },
    "last_modified": {
        "type": "/type/datetime",
        "value": "2024-11-30T16:43:57.207894"
    }
}